// homework
// Всі функції повинні бути описані стрілочним типом!!!!
// - створити функцію яка обчислює та повертає площу прямокутника висотою

// let sRectangle = (b, h) => b * h;
// console.log(sRectangle(10,20));

// - створити функцію яка обчислює та повертає площу кола

// let sCircle = (diameter) => Math.PI*diameter*diameter/4;
// console.log(sCircle(10));

// - створити функцію яка обчислює та повертає площу циліндру
//
// let sCircle = (diameter) => Math.PI*diameter*diameter/4;
// let sCylinder=(diameter,heightCylinder)=> sCircle(diameter)*2+Math.PI*heightCylinder*diameter;
// console.log(sCylinder(10,10));

// - створити функцію яка приймає масив та виводить кожен його елемент

// let arr=[1,2,'jsgdf;gjh',8];
// let printArr= (arr) => {
//     for (const arrElement of arr) {
//         console.log(arrElement)
//     }
// }
// printArr(arr);

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

let criateParagraph=(text)=> document.write(`<p>Hello  ${text} 👋</p>`);

criateParagraph('Vasia');
criateParagraph('Petia');


// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

// classwork
// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// - створити функцію яка повертає найбільше число з масиву// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].

//ADDITIONAL

// - Дано натуральное число n. Выведите все числа от 1 до n.
// function printNaturNumbers(n){
//     let i=1;
//     console.log(i);
//     if(n===i){return}
// }
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]




